const projects = [
  {
    slug: 'garazhzhzh-brand-identity',
    coverUrl: `знак стрелка на дереве-2.png`,
    title: 'Гаражжж | Айдентика ',
    shortDescription: 'Айдентика и визуальная система для бара.',
    fullDescription: `<h3>О проекте</h3>
<h3 class="big-description">
«Гаражжж» — вымышленный автосервис для жуков всех видов и размеров. Здесь можно починить лапки, отполировать крылья или подготовиться к главным летательным гонкам сезона. Проект объединяет автомобильную эстетику, мир насекомых и атмосферу гоночных соревнований в яркую фантазийную айдентику.
</h3>
<h3> Цель проекта
</h3>
<p>
Целью проекта стала разработка малого фирменного стиля для вымышленного автосервиса. Основной задачей было создать выразительную визуальную систему, которая сочетает динамику автоспорта с образами жуков.
</p>
<h3>
О дизайне
</h3>
<p>
Визуальная система построена на ощущении скорости, движения и неонового свечения. Графические элементы напоминают следы от шин, траектории движения и гоночные трассы, создавая динамичный ритм внутри композиции.
<br>
<br>
Яркие линии и неоновые цвета контрастируют с тёмным фоном, отсылая к светящимся жукам и насыщенным оттенкам их крыльев.
<br>
<br>
Логотип построен на форме буквы «Ж» и визуально напоминает следы протекторов шин, что напрямую связывает фирменный стиль с темой автосервиса и гонок.
</p>`,
    tags: ['Айдентика', 'Иллюстрация', 'Упаковка'],
    content: [
      {
        type: 'double',
        content: [
          // путь "../img/projects/slug/" +
          `логотип.png`,
          `канцелярия.png`,
        ],
      },

      {
        type: 'single',
        content: 'Шоппер.png',
      },

      {
        type: 'double',
        content: [
          // путь "../img/projects/slug/" +
          `брошюра.png`,
          `балончик.png`,
        ],
      },

      {
        type: 'single',
        content: 'веер.png',
      },

      {
        type: 'single',
        content: 'Stationary без визиток.png',
      },

      {
        type: 'single',
        content: 'наклейки.png',
      },

      {
        type: 'double',
        content: [`жуки с наклейками 1.png`, `жуки с наклейками 2.png`],
      },

      {
        type: 'single',
        content: 'знак стрелка на дереве-2.png',
      },

      {
        type: 'single',
        content: 'освежитель.png',
      },

      {
        type: 'single',
        content: 'кубок.png',
      },
    ],
  },

  {
    slug: 'zverium',
    coverUrl: `мерч.jpg`,
    title: 'Звериум | Приложение ',
    shortDescription: 'Айдентика и визуальная система для бара.',
    fullDescription: `<h3> О проекте </h3>


<h3 class="big-description">    «Звериум» — это фантастическое образовательное пространство, в котором наставниками становятся животные, а обучение строится вокруг их природных способностей и уникального характера. Здесь гепард обучает скорости и выносливости, ленивец помогает освоить искусство отдыха и внутреннего баланса, а павлин вдохновляет на самовыражение и уверенность в себе.
<br> <br>Пользователи могут посещать регулярные занятия, мастер-классы, интенсивы и тематические курсы, взаимодействуя с харизматичными животными-преподавателями через мобильное приложение.
</h3>

<h3> Цель проекта </h3>

<p>
Целью проекта стала разработка мобильного приложения и фирменного стиля для «Звериума». Основной задачей было создать яркий и дружелюбный интерфейс, который делает образовательный процесс более увлекательным и эмоциональным.

В рамках проекта были разработаны структура приложения, система навигации и ключевые функции: расписание занятий, календарь, блог животных-наставников и система записи на курсы.
</p>
<h3> О дизайне </h3>
<p>
Визуальная айдентика проекта построена на ярких цветах, мягких формах и иллюстрациях животных и людей. Интерфейс сочетает игровые элементы с понятной навигацией, а фирменная палитра отражает разнообразие направлений внутри платформы.
</p>`,
    tags: ['Айдентика', 'Интерфейс', 'Упаковка'],
    content: [
      // путь "../img/projects/slug/" + [
      {
        type: 'single',
        content: '1.jpg',
      },

      {
        type: 'text',
        content: `Lentiful is an instant lentil company aiming to provide
          nutrient-dense, delicious and healthy lunches at a moment’s notice.
          Founder Ben Bacon came to me to develop a full brand identity and
          packaging system. Our goal was to transform a traditionally overlooked
          category in`,
      },

      {
        type: 'single',
        content: 'палитра.png',
      },

      {
        type: 'single',
        content: 'мерч.jpg',
      },

      {
        type: 'single',
        content: 'постер.jpg',
      },

      {
        type: 'single',
        content: 'анбординг.png',
      },

      {
        type: 'single',
        content: 'экраны-1.jpg',
      },

      {
        type: 'single',
        content: 'userflow.png',
      },

      {
        type: 'single',
        content: 'экраны-2.jpg',
      },

      {
        type: 'single',
        content: 'календарь.jpg',
      },

      {
        type: 'single',
        content: 'достижения.jpg',
      },

      {
        type: 'single',
        content: 'блог.jpg',
      },
    ],
  },

  {
    slug: 'garazhzhzh-3d-environment',
    coverUrl: `кафе.png`,
    title: 'Гаражжж | 3D Пространство',
    shortDescription: 'Айдентика и визуальная система для бара.',
    fullDescription: `<h3>
 О проекте
</h3>
<h3 class="big-description">
«Гаражжж» — фантазийный автосервис для жуков, переосмысленный как самостоятельное пространство со своей атмосферой, архитектурой и внутренним устройством. В новой концепции мастерская собрана из найденных человеческих предметов, которые жуки адаптировали под свои нужды.
<br>
<br>
Обычные вещи в этом мире становятся мебелью, инструментами, деталями интерьера и элементами инфраструктуры. Пространство было детально разработано в программе Blender: были продуманы интерьер, планировка, система мастерских, декоративные элементы и общая атмосфера автосервиса.
</h3>
<h3>
Цель проекта
</h3>
<p>
Целью проекта стало создание концептуального пространства и печатного издания, раскрывающего устройство мира «Гаражжж». Основной задачей было разработать визуально цельную среду с собственными правилами, эстетикой и материальностью, а также передать её через формат книги-путеводителя.
</p>
`,
    tags: ['3D', 'Книга'],
    content: [
      // путь "../img/projects/slug/" + [
      {
        type: 'single',
        content: 'общий план сбоку.png',
      },

      {
        type: 'single',
        content: 'общий план сверху.png',
      },

      {
        type: 'text',
        content: `<h3>
О дизайне
</h3>
<p>
Книга представляет собой путеводитель по автосервису, созданный самими жуками для своих гостей. Она выглядит немного наивно и неаккуратно, будто собрана вручную из случайно найденных материалов, так же, как и само пространство мастерской.
<br>
<br>
Формат книги построен на пропорциях майского жука: высота страницы соотнесена с длиной его тела, а ширина разворота — с размахом крыльев. Для удобства размеры были увеличены в два раза, сохранив связь с образом насекомого.
</p>`,
      },

      {
        type: 'single',
        content: 'обложки.png',
      },

      {
        type: 'double',
        content: [`персонаж.png`, `вход.png`],
      },

      {
        type: 'single',
        content: '1 этаж.png',
      },

      {
        type: 'double',
        content: [`вертушка.png`, `люк.png`],
      },

      {
        type: 'text',
        content: `<p>
При печати использовалась бумага разных оттенков, благодаря чему книга выглядит собранной из найденных листов. Обложка выполнена из обрезков бумаги и картона, а для переплёта использованы пуговицы, бусины и гайки, что усиливает ощущение ручной сборки.
</p>`,
      },

      {
        type: 'single',
        content: 'развороты-1.png',
      },

      {
        type: 'single',
        content: 'кафе.png',
      },

      {
        type: 'single',
        content: 'разворот-1.png',
      },

      {
        type: 'double',
        content: [`витрина.png`, `кукурузки.png`],
      },

      {
        type: 'single',
        content: '2 этаж снаружи.png',
      },
      {
        type: 'single',
        content: 'развороты-2.png',
      },

      {
        type: 'double',
        content: [`знак ягода.png`, `знак гайка.png`],
      },

      {
        type: 'single',
        content: 'разворот-2.png',
      },

      {
        type: 'single',
        content: '2 этаж.png',
      },

      {
        type: 'double',
        content: [`краски.png`, `мойка.png`],
      },

      {
        type: 'single',
        content: 'флэт план-1.png',
      },

      {
        type: 'single',
        content: 'флэт план-2.png',
      },
    ],
  },

  {
    slug: 'garazhzhzh-web-poster',
    coverUrl: `iphone.png`,
    title: 'Гаражжж | Веб-плакат',
    shortDescription: 'Айдентика и визуальная система для бара.',
    fullDescription: `<h3> О проекте </h3>

<h3 class="big-description"> «Гаражжж» — одностраничный веб-плакат, развивающий визуальную вселенную автосервиса для жуков.
Пользователь наблюдает за гонкой от стартового отсчёта до финала: жуки проходят повороты, объезжают препятствия, попадают в туннели и подземные участки трассы, а в конце победителя ждёт кубок и титул самого быстрого жука.
</h3>
<h3>
 Цель проекта
</h3>
<p>
Целью проекта была разработка одностраничного веб-сайта, в котором ключевую роль играют графика, композиция и анимация. Основной задачей стало создание динамичного и визуально цельного интерфейса с использованием только HTML и CSS.
<br>
<br>
Отдельное внимание было уделено анимации персонажей: бегущие жуки были реализованы с помощью покадровой CSS-анимации, что помогло сделать сцену более живой и игровой.
</p>
<h3>
О дизайне
</h3>
<p>
Визуальный стиль проекта построен на милой векторной графике и ограниченной цветовой палитре. Все элементы интерфейса — от трассы до типографики — выполнены в единой изометрической проекции, благодаря чему сайт воспринимается как цельное пространство.
<br>
<br>
Яркие акценты, простые геометрические формы и ритмичная композиция создают ощущение движения и поддерживают атмосферу аркадной гонки.
<br>
<br>
Сайт был разработан адаптивным: помимо десктопной версии были созданы интерфейсы для планшетов и мобильных устройств, сохранившие композицию и визуальную целостность проекта.
</p>`,
    tags: ['Веб-дизайн', 'Анимация', 'Иллюстрация'],
    content: [
      // путь "../img/projects/slug/" + [
      {
        type: 'single',
        content: 'desktop.png',
      },

      {
        type: 'single',
        content: 'adaptive.png',
      },

      {
        type: 'double',
        content: [`ipad.png`, `iphone.png`],
      },

      {
        type: 'double',
        content: [`github.png`, `figma.png`, `beetle.png`],
      },
    ],
  },

  {
    slug: 'font-tt-autonomous',
    coverUrl: `desktop-1.png`,
    title: 'TT Autonomous | Веб-плакат',
    shortDescription: 'Айдентика и визуальная система для бара.',
    fullDescription: `<h3> О проекте</h3>
<h3 class="big-description">
Проект посвящён одностраничному сайту о шрифте TT Autonomous — современном технологичном гротеске с брутальной геометрией и угловатыми формами. Основной идеей стало исследование того, как визуальный язык сайта может передавать характер шрифта через атмосферу и метафору.
</h3>
<h3>
О дизайне
</h3>
<p>
Концепция сайта вдохновлена эстетикой промышленности, инженерии и механизмов. Брутальная геометрия шрифта сочетается с визуальными образами машинных конструкций и индустриальной среды.

Дизайн построен на ограниченной цветовой палитре, игрой с типографикой и векторными иллюстрации индустриальных механизмов.
<p>`,
    tags: ['Веб-дизайн', 'Иллюстрация'],
    content: [
      // путь "../img/projects/slug/" + [
      {
        type: 'single',
        content: 'desktop-1.png',
      },

      {
        type: 'single',
        content: 'концепция.png',
      },

      {
        type: 'double',
        content: [`вариативность.png`, `языки.png`],
      },

      {
        type: 'single',
        content: 'детали.png',
      },

      {
        type: 'single',
        content: 'desktop-2.png',
      },

      {
        type: 'double',
        content: [`экран-1.png`, `экран-2.png`],
      },
    ],
  },
];
